Revit 2024 API
FamilyPointLocation.GetLocation Method
 Gets the location of the point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public Transform GetLocation()
Visual Basic
Public Function GetLocation As Transform
Visual C++
public:
Transform^ GetLocation()
Return Value
 The location of the point.
See Also
FamilyPointLocation Class
Autodesk.Revit.DB Namespace